## Урок 27. Генераторы множеств. Генераторы словарей.

### 27.1 Генератор множеств.

**Генератор множеств** — это удобный способ создания множеств (`set`) с использованием выражений.

- **Синтаксис**:

  ```
  {выражение for элемент in итерируемый_объект}
  ```

### 27.2 Пример: Выделение уникальных значений из списка.

```python
my_list = [1, 2, 2, 3, 4, 4, 5]
unique_values = {x for x in my_list}
print(unique_values)  # {1, 2, 3, 4, 5}
```

### 27.3 Генератор словарей.

**Генератор словарей** позволяет создавать словари с использованием аналогичного синтаксиса.  
Он используется для создания пар "ключ-значение".

- **Синтаксис**:

  ```
  {ключ: значение for элемент in итерируемый_объект}
  ```

### 27.4 Пример: Поменять местами значения и ключи

```python
my_dict = {"неудовл.": 2, "удовл.": 3, "хорошо": '4', "отлично": '5'}
swapped_dict = {value: key for key, value in my_dict.items()}
print(swapped_dict)
# {2: 'неудовл.', 3: 'удовл.', '4': 'хорошо', '5': 'отлично'}
```

### Вывод:

Таким образом, генераторы множеств и словарей в Python позволяют эффективно создавать коллекции с использованием компактного и понятного синтаксиса.

### Задачи:

1. На вход программе подается строка со списком оценок, например: `2 неудовлетворительно удовлетворительно хорошо отлично`. Первая цифра - это числовое значение первой оценки. Остальные оценки имеют возрастающие числа на 1. Необходимо прочитать эту строку и с помощью генератора словарей сформировать словарь d, в котором ключами будут выступать числа, а значениями - слова.

2. На автомойку в течение квартала заезжали машины. Их гос. номера фиксировались в журнале, следующим образом: `auto = ["Е220СК","А120МВ","В101АА","Е220СК","А120МВ"]`. На основе этого списка через генератор множеств сформировать еще один список уникальных машин. На экран вывести число уникальных машин.

3. На вход программе подается строка со словами, записанными через пробел. Необходимо прочитать эту строку и с помощью генератора множеств сформировать множество из уникальных слов без учета регистра и длина которых не менее трех символов. Вывести на экран размер этого множества.

4. На парковке записывают номера машин и время их пребывания: `cars = [("Е220СК", 3), ("А120МВ", 5), ("В101АА", 2), ("Е220СК", 1), ("А120МВ", 3)]`. формируйте словарь, где ключами будут номера машин, а значениями — общее время пребывания на парковке. Затем создайте множество машин, которые провели на парковке больше 3 часов. Выведите оба результата.

5. У вас есть список продуктов с их ценами и категориями: `products = [("Яблоки", 50, "Фрукты"), ("Бананы", 40, "Фрукты"), ("Молоко", 70, "Молочные"), ("Хлеб", 30, "Хлебобулочные")]`. Сформируйте словарь, где ключами будут категории, а значениями — суммы цен продуктов из этих категорий. Затем найдите категорию с наибольшими расходами. Выведите оба результата.

6. На вход программе подаются строки с именами клиентов и их заказами, разделённые пробелом, пока пользователь не введет слово `exit` (без учета регистра). Сформируйте словарь, где ключами будут имена клиентов, а значениями — множества уникальных заказов каждого клиента. Выведите итоговый словарь. Пример входных данных:

   ```
   Иван чай
   Анна кофе
   Иван булка
   Сергей чай
   Анна торт
   ```

7. На вход программе подаётся текст: `Привет мир! Этот мир полон чудес. Python помогает изучать этот мир.`. Создайте множество уникальных слов, удаляя пунктуацию и приводя их к нижнему регистру. Строка с символами пунктуации: `!"#$%&'()*+,-./:;<=>?@[\]^_{|}~`. Затем создайте словарь, где ключами будут эти слова, а значениями — длина каждого слова. Выведите оба результата.
