## Урок 19. Примеры задач решаемых с помощью цикла for

### 19.1 Вычисление факториала от натурального числа n.

**Факториал числа** - это **произведение всех положительных целых чисел от 1 до данного числа**.

**Решение**:

```python
number = 5
factorial = 1

for i in range(1, number + 1):
    factorial = factorial * i

print(factorial)
```

В этом коде мы инициализируем переменную `factorial` значением `1`. Затем мы используем цикл `for`, чтобы умножить `factorial` на каждое число от `1` до `number`. В результате получаем факториал числа `number`.

### 19.2 Отображение символов \* в виде елочки.

```
*
**
***
****
*****
******
```

**Решение**:

```python
for i in range(1, 7):
    print('*' * i)
```

Счетчик `i` будет принимать значения `1`, `2`, `3`, `4`, `5` и `6`. Соответственно, функция `print()` будет дублировать символ `*` `i` раз.

### 19.3 Cоединить все слова списка в одно предложение.

```python
words = ["Python", "JavaScript", "C++", "Java", "TypeScript", "PHP", "Rust", "Go"]

str = ''
for word in words:
    str += ' ' + word

print(str.lstrip())
```

### 19.4 Все двузначные числа в списке заменить нулями.

```python
digs = [4, 3, 100, -53, -30, 1, 34, -8]

for i in range(len(digs)):
    if 10 <= abs(digs[i]) <= 99:
        digs[i] = 0

print(digs)
```

в цикле перебираем индексы элементов списка, а не сами элементы. Благодаря этому, в цикле получаем возможность изменять значение i-го элемента.

### 19.5 Цикл for и функция enumerate()

Функция **enumerate()** используется вместе с циклом for для получения **индекса** и **значения** элемента во время итерации. Она возвращает **объект**, который генерирует пары значений - **индекс элемента** и **сам элемент**.

**Задача**: Все двузначные числа в списке заменить нулями используя функцию enumerate()

```python
digs = [4, 3, 100, -53, -30, 1, 34, -8]

for i, d in enumerate(digs):
    if 10 <= abs(d) <= 99:
        digs[i] = 0

print(digs)
```

### 19.6 Преобразование кириллицы в латиницу.

```python
# список замен для соответствующих русских букв
t = ['a', 'b', 'v', 'g', 'd', 'e', 'zh',
     'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p',
     'r', 's', 't', 'u', 'f', 'h', 'c', 'ch', 'sh',
     'shch', '', 'y', '', 'e', 'yu', 'ya'
]
# кодовое значение для первой буквы этого списка
start_index = ord('а')
# зададим строку и переменную slug, где будем формировать строку на латинице
title = "Программирование на Python - лучшее занятие"
slug = ''
#  преобразование в цикле, перебирая каждый символ исходной строки
for s in title.lower():
    if 'а' <= s <= 'я':
        slug += t[ord(s) - start_index]
    elif s == 'ё':
        slug += 'yo'
    elif s in ' !?:,.':
        slug += '-'
    else:
        slug += s
# удалим все подряд идущие символы дефиса
while slug.count('--'):
    slug = slug.replace('--', '-')
# выводим результат
print(slug)
```

### Задачи:

1. На вход программе подается строка. Необходимо ее прочитать и найти в ней все индексы строкового фрагмента "ра". Выведите найденные индексы на экран в одну строчку через пробел. Если же фрагмент "ра" отсутствует в строке, то вывести -1.

2. На вход программе подается строка с номером телефона. Ожидается следующий формат номера в строке: `+7(xxx)xxx-xx-xx`. Число введенных символов считается всегда верным. Необходимо прочитать строку из входного потока и проверить, что она содержит номер телефона в соответствии с приведенным форматом. Вывести "ДА", если это так и "НЕТ" в противном случае.

3. На вход программе подается строка, в которой записано арифметическое выражение. Например: `10 + 25 - 12`. Количество действий сложения или вычитания может быть произвольным. Необходимо прочитать эту строку из входного потока и выполнить вычисление, записанного в ней арифметического выражения. Результат вычисления отобразить на экране. Полагается, что в качестве арифметических операций используется только сложение (+) и вычитание (-), а в качестве операндов только целые неотрицательные числа. Следует учесть, что математические операции могут быть записаны как с пробелами (до и после), так и без них.

4. На вход программе подаются целые числа, записанные в одну строку через пробел. Необходимо прочитать эти числа и сохранить в списке. Затем, каждое значение этого списка изменить на квадрат соответствующего числа. Результат (список) выведите на экран в виде последовательности чисел, записанных через пробел. Программу следует реализовать с использованием функции enumerate.

5. На вход программе подаются целые числа, записанные в одну строку через пробел. Необходимо прочитать эти числа и сохранить в списке. Затем, каждый элемент этого списка продублировать один раз. Например, для списка: `[1, 2, 3]`. после дублирования должны получить: `[1, 1, 2, 2, 3, 3]`. Результат (список) выведите на экран.

6. На вход программе подаются вещественные числа, записанные через пробел. Необходимо прочитать эти числа и сохранить в списке. Затем, с помощью цикла for нужно найти наименьшее число в этом списке. Полученный результат (минимальное число) вывести на экран. Реализовать программу без использования функции min, max и сортировки.

7. На вход программе подаются вещественные числа, записанные через пробел. Необходимо прочитать эти числа и сохранить в списке. Затем, все отрицательные значения в этом списке заменить на -1.0. Результат (список) выведите на экран в виде последовательности чисел, записанных через пробел. Программу следует реализовать с использованием функции enumerate.
