## Урок 8. Экранирование символов. Спецсимволы

### 8.1 Специальные символы

**Специальные символы** - это символы, которые имеют **особое значение** и **используются для определенных целей** в строках или коде на языке Python.

### 8.2 Экранирование символов.

**Экранирование символов** - это процесс использования **обратной косой черты** `(\)` перед специальными символами, чтобы указать, что они **должны быть интерпретированы как обычные символы, а не как часть синтаксиса языка Python**.  
Это позволяет **использовать символы, которые обычно имеют специальное значение, в строках или коде Python**.

### 8.3 Список специальных символов в Python:

- `\n` - Перевод строки
- `\\` - Символ обратного слеша
- `\’` - Символ апострофа
- `\"` - Символ двойной кавычки
- `\a` - Звуковой сигнал
- `\b` - Эмуляция клавиши BackSpace
- `\f` - Перевод формата
- `\r` - Возврат каретки
- `\t` - Горизонтальная табуляция (размером в 4 пробела)
- `\v` - Вертикальная табуляция
- `\0` - Символ Null (не признак конца строки)
- `\xhh` - Символ с шестнадцатиричным кодом hh
- `\ooo` - Символ с восьмиричным кодом ooo
- `\N{id}` - Идентификатор из кодовой таблицы Unicode
- `\uhhhh` - 16-битный символ Unicode в шестнадцатиричной форме
- `\Uhhhhhhhh` - 32-битный символ Unicode в шестнадцатиричной форме
- `\другое` - Не является экранированной последовательностью

### 8.4 Наиболее распространенные специальные символы:

- `\n` - символ новой строки
- `\t` - символ табуляции
- `\"` - двойная кавычка
- `\'` - одинарная кавычка
- `\\` - обратная косая черта

### 8.5 Явное указание специальных символов

#### Примеры:

- **Символ новой строки** `\n`:
  ```python
  print("Привет,\nмир!")
  ```
- **Символ табуляции** `\t`:
  ```python
  print("Имя:\tДжон")
  ```
- **Двойная кавычка** `\"`:
  ```python
  print("Он сказал: \"Привет!\"")
  ```
- **Одинарная кавычка** `\'`:
  ```python
  print('Она сказала: \'Привет!\'')
  ```
- **Обратная косая черта** `\\`:
  ```python
  print("Путь к файлу: C:\\папка\\файл.txt")
  ```
- Символ возврата каретки `\r`. :

  ```python
  print("Привет,\rмир!")
  ```

  `Возврат каретки (\r)` - это специальный символ в Python, который обозначает **перевод каретки в начало текущей строки**.  
  При использовании этого символа, **курсор перемещается в начало строки, и последующий вывод замещает уже существующий текст** на этой строке.  
  Например, если вы используете символ `\r` в строке вывода, то **следующий текст будет начинаться с начала строки, перезаписывая предыдущий текст** на этой строке.  
  Это может быть полезно, например, при **создании анимаций в терминале или обновлении прогресс-бара**.  
  **Пример использования**:

  ```python
  import time

  for i in range(10):
      print(f"Прогресс: {i}/10", end="\r")
      time.sleep(1)
  ```

- **Символ возврата на одну позицию назад**. Эмуляция клавиши BackSpace `\b`:

  ```python
  print("Привет\bмир!")
  ```

  Специальный символ, который используется для эмуляции действия клавиши BackSpace. Этот символ перемещает курсор на одну позицию влево, что позволяет "удалить" символ, находящийся перед курсором, при выводе текста.

- Символ перевода страницы `\f`:
  ```python
  print("Заголовок\n\nТекст\fПодзаголовок")
  ```
  Это символ перевода страницы (form feed). Он используется для управления печатью и в основном предназначен для старых принтеров, чтобы начать новую страницу. В современных приложениях его использование довольно редкое.
  ```python
  print("Первая строка\fВторая строка")
  ```
  **Вывод может зависеть от среды**, в которой выполняется код, но **в большинстве случаев он просто не будет иметь заметного эффекта** в текстовом выводе.

### Вопросы:

1. Что такое спецсимволы?
2. Что такое экранирование символов?
3. Что происходит, если в строке не экранировать специальный символ?
4. Какие основные спецсимволы для строк существуют?

### Задачи:

1. Задать строку со следующим содержимым: `Он сказал: "спецсимволы"`. Вывести ее на экран.
2. На вход программе подается строка, состоящая из двух слов, записанных в одну строчку через пробел. Необходимо прочитать строку и между словами поставить символ обратного слеша вместо пробела. Результирующую строку отобразите на экране.
3. На вход программе подается слово в виде строки. Необходимо прочитать его и сформировать новую строку, где введенное слово будет заключено в двойные кавычки. Результат вывести на экран.
4. На вход программе подается строка со словами, разделенными пробелами. В строке может присутствовать от одного и более слов. Необходимо прочитать строку и первый пробел заменить на **одинарную кавычку** `'`, а все **остальные** - на двойные `"`. Результирующую строку вывести на экран. **Пример входящей строки**: `Экранирование символов`.
