## Урок 17. Циклы в Python. Цикл While

### 17.1 Циклы в Python.

**Циклы в программировании** - это конструкции, которые позволяют выполнять **повторяющиеся действия**.  
Они позволяют **автоматизировать выполнение определенных задач**, которые требуют **повторения одного и того же кода несколько раз**.

### 17.2 Зачем нужны циклы?

**Циклы** позволяют нам **выполнять один и тот же блок кода несколько раз**, что делает программы **более эффективными и гибкими**.  
Они позволяют **обрабатывать** **большие объемы данных**, **выполнять итерации по элементам списка или массива**, а также **повторять действия до тех пор, пока выполняется определенное условие**.

### 17.3 Примеры циклов на языке программирования Python.

1. Цикл `for`

```python
numbers = [1, 2, 3, 4, 5]
for num in numbers:
    print(num)
```

2. Цикл `while`

```python
count = 0
while count < 5:
    print(count)
    count += 1
```

### 17.4 Цикл `While`

Цикл `while` в Python позволяет выполнять **повторяющиеся действия до тех пор, пока выполняется определенное условие**.

**Синтаксис**:

```
while условие: <= заголовок цикла
    тело цикла
```

- **Условие**: это выражение, которое проверяется перед каждой итерацией цикла. Если условие истинно, то выполняется заголовок и тело цикла. Если условие ложно, то выполнение цикла прекращается и программа продолжает выполняться после цикла.
- **Заголовок цикла**: это блок кода, который выполняется перед каждой итерацией цикла. Обычно в заголовке цикла происходит инициализация переменных, которые используются в условии цикла.
- **Тело цикла**: это блок кода, который выполняется при каждой итерации цикла. В теле цикла можно выполнять нужные действия, например, обработку данных или изменение значений переменных.

### 17.5 Цикл `while` для нахождения суммы

```python
N = 10
sum = 0
i = 1

while i <= N:
    sum = sum + i
    i = i + 1

print("Сумма чисел от 1 до", N, ":", sum)
```

В этом примере мы **инициализируем переменные** `N`, `sum` и `i`.  
Затем мы используем цикл `while`, чтобы при каждой итерации добавлять значение `i` к сумме `sum` и увеличивать `i` на 1.  
Цикл продолжается, пока `i` не станет больше `N`.  
После окончания цикла мы выводим на экран сумму чисел от **1 до N**.

### 17.6 Условия в цикле. Итерация.

**Итерация** - Однократное выполнение тела цикла.

В цикле **while** можно прописывать различные условия. Условие должно быть **выражением, которое возвращает логическое значение `True` или `False`**. **Цикл будет выполняться, пока условие остается истинным (`True`)**. **Когда условие становится ложным (`False`), выполнение цикла прекращается**.

**Примеры условий**, которые можно прописывать в цикле `while`:

- **Сравнение чисел**: `x < y`, `x <= y`, `x > y`, `x >= y`, `x == y`, `x != y`.
- **Логические операции**: `and`, `or`, `not`.
- **Использование функций**: `len(some_list) > 0`, `is_valid(input)`.
- **Использование переменных**: `count < max_count`, `total_sum != 100`.

### 17.7 Цикл `while` для проверки пароля пользователя.

```python
password = input("Введите пароль: ")

while password != "good_pass":
    print("Неверный пароль. Попробуйте еще раз.")
    password = input("Введите пароль: ")

print("Доступ разрешен. Добро пожаловать!")
```

### Вопросы:

1. Что такое циклы в программировании?
2. Какие циклы есть в Python?
3. Какие условия можно прописывать в цикле While?
4. Что такое Заголовок цикла?
5. Что такое Тело Цикла?
6. Что такое Итерация?

### Задачи:

1. На вход программы подаются два целых положительных числа `n` и `m`, записанных через пробел, причем, `n` < `m`. Необходимо прочитать эти числа и вывести в одну строку через пробел квадраты целых чисел в диапазоне `[n; m]`. Программу реализовать при помощи цикла `while`.

2. На вход программы подается вещественное число: стоимость одной книги `x` рублей. Необходимо прочитать это число и вывести на экран в одну строчку через пробел стоимости `2`, `3`, ... `10-ти` таких книг с точностью до десятых. Программу реализовать при помощи цикла while.

3. На вход программы подается целое положительное число `n`. Прочитайте это число, а затем, вычислите и выведите на экран следующую сумму с точностью до тысячных (три знака после запятой): `S = 1 + 1/2 + 1/3 + ... + 1/N`. Программу реализовать при помощи цикла `while`.

4. Написать программу, в которой пользователь на каждой итерации цикла (`while`) должен вводить целое число. Цикл должен продолжаться, пока пользователь не введет число `0`. Необходимо вычислить сумму введенных в цикле чисел и вывести результат (`сумму`) на экран. Программу реализовать при помощи цикла `while`.

5. На вход программе подается строка (слаг). Прочитайте эту строку и замените в ней все подряд идущие дефисы (`--`, `---`, `----` и т.д.) на одинарные (`-`). Результат преобразования строки выведите на экран. Программу реализовать при помощи цикла `while`. Пример входящей строки: `osnovnye--metody-----spiska`.

6. На вход программе подается натуральное число (то есть, целое положительное) от трехзначного и более. Необходимо прочитать это число и найти произведение всех его цифр. Результат (произведение) вывести на экран. Программу реализовать при помощи цикла `while`.

7. Последовательность Фибоначчи образуется так: первые два числа равны `1` и `1`, а каждое последующее равно сумме двух предыдущих. В итоге, получаем такую последовательность чисел: `1, 1, 2, 3, 5, 8, 13, ...` На вход программе подается целое положительное число `n`. Прочитайте это число и сформируйте последовательность Фибоначчи длиной `n`. Например, при `n = 4` получается последовательность: `1 1 2 3`. Результат отобразите в виде строки полученных чисел, записанных через пробел. Программу реализовать при помощи цикла `while`.

8. На вход программе подается целое положительное число (количество часов). Прочитайте это число и сохраните в переменной `n`. Пусть одноклеточная амеба каждые `3 часа` делится на `2 клетки`. Необходимо определить, сколько клеток будет через `n` часов. Считать, что изначально была одна амеба. Результат (итоговое число клеток) вывести на экран. Задачу необходимо решить с использованием цикла while. Если пользователь ввел `11` результат будет `8`.

9. Гражданин 1 января открыл счет в банке, вложив `1000 руб`. Каждый год размер вклада увеличивается на `5%` от имеющейся суммы. Определить сумму вклада через `n` лет (n - целое положительное число, читаемое из входного потока). Результат (сумму вклада) округлить до сотых и вывести на экран. Программу реализовать при помощи цикла `while`.

10. На вход программе подаются два натуральных четных числа `n` и `m`, записанных в одну строчку через пробел, причем `n < m`. Необходимо прочитать эти числа и напечатать все нечетные числа из интервала от `n` до `m`. Задачу следует решить без применения условного оператора. Результат вывести на экран в виде строки чисел, записанных через пробел. Программу реализовать при помощи цикла `while`.

11. Составить программу поиска всех трехзначных чисел, которые при делении на `47` дают в остатке `43` и кратны `3`. Вывести найденные числа в одну строчку через пробел в порядке возрастания. Программу реализовать при помощи цикла `while`.
